#include <stdio.h>
int main()
{
    int n, x, i;
    for (n = 1;; n++) // n为椰子总数，迭代计算
    {
        x = n; // 每次迭代时重置x为当前椰子总数
        for (i = 1; i <= 5; i++) // 迭代处理每个水手分椰子的操作
        {
            if (x % 5 == 1)          // 每次分完的剩余量必须为1
                x = (x - 1) / 5 * 4; // 按照题目要求分椰子
            else                     // 如有一个船员分完椰子后剩下的数量不为1，则跳出本次循环，继续尝试下一个椰子数
                break;
        }
        if (i > 5 && x % 5 == 0) // 若成功分了5次椰子，则输出椰子数并结束
        {
            printf("原来有%d个椰子\n", n);
            break;
        }
    }
    return 0;
}